html/v2ray/basic/log.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>日志</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="dns.html"> UP </a>
 |
 <a accesskey="H" href="basic.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">日志</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org875043f">配置</a>
<ul>
<li><a href="#orgbd5c6f5">客户端</a></li>
<li><a href="#org1cf4501">服务器</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
对于软件开发者来说使用查看日志是一种非常有效的调试手段。普通用户使用日志可以知道软件的运行状况，并且当软件出现异常时提供日志给开发者可以令开发者更加容易找到问题的根源，加快修复问题
</p>

<div id="outline-container-org875043f" class="outline-2">
<h2 id="org875043f">配置</h2>
<div class="outline-text-2" id="text-org875043f">
</div>
<div id="outline-container-orgbd5c6f5" class="outline-3">
<h3 id="orgbd5c6f5">客户端</h3>
<div class="outline-text-3" id="text-orgbd5c6f5">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"log"</span>: {
        <span style="color: #ffa07a;">"loglevel"</span>: <span style="color: #ffa07a;">"warning"</span>, <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#26085;&#24535;&#32423;&#21035;</span>
        <span style="color: #ffa07a;">"access"</span>: <span style="color: #ffa07a;">"D:\\v2ray\\access.log"</span>,  <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#36825;&#26159; Windows &#31995;&#32479;&#30340;&#36335;&#24452;</span>
        <span style="color: #ffa07a;">"error"</span>: <span style="color: #ffa07a;">"D:\\v2ray\\error.log"</span>
    },
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 1080,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"socks"</span>,
            <span style="color: #ffa07a;">"sniffing"</span>: {
                <span style="color: #ffa07a;">"enabled"</span>: <span style="color: #7fffd4;">true</span>,
                <span style="color: #ffa07a;">"destOverride"</span>: [<span style="color: #ffa07a;">"http"</span>, <span style="color: #ffa07a;">"tls"</span>]
            },
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"auth"</span>: <span style="color: #ffa07a;">"noauth"</span>
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"vnext"</span>: [
                    {
                        <span style="color: #ffa07a;">"address"</span>: <span style="color: #ffa07a;">"serveraddr.com"</span>,
                        <span style="color: #ffa07a;">"port"</span>: 16823,  
                        <span style="color: #ffa07a;">"users"</span>: [
                            {
                                <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,  
                                <span style="color: #ffa07a;">"alterId"</span>: 64
                            }
                        ]
                    }
                ]
            }
        }
    ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cf4501" class="outline-3">
<h3 id="org1cf4501">服务器</h3>
<div class="outline-text-3" id="text-org1cf4501">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #ffa07a;">"log"</span>: {
        <span style="color: #ffa07a;">"loglevel"</span>: <span style="color: #ffa07a;">"warning"</span>,
        <span style="color: #ffa07a;">"access"</span>: <span style="color: #ffa07a;">"/var/log/v2ray/access.log"</span>, <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#36825;&#26159; Linux &#30340;&#36335;&#24452;</span>
        <span style="color: #ffa07a;">"error"</span>: <span style="color: #ffa07a;">"/var/log/v2ray/error.log"</span>
    },
    <span style="color: #ffa07a;">"inbounds"</span>: [
        {
            <span style="color: #ffa07a;">"port"</span>: 16823,
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"vmess"</span>,   
            <span style="color: #ffa07a;">"settings"</span>: {
                <span style="color: #ffa07a;">"clients"</span>: [
                    {
                        <span style="color: #ffa07a;">"id"</span>: <span style="color: #ffa07a;">"b831381d-6324-4d53-ad4f-8cda48b30811"</span>,  
                        <span style="color: #ffa07a;">"alterId"</span>: 64
                    }
                ]
            }
        }
    ],
    <span style="color: #ffa07a;">"outbounds"</span>: [
        {
            <span style="color: #ffa07a;">"protocol"</span>: <span style="color: #ffa07a;">"freedom"</span>,  
            <span style="color: #ffa07a;">"settings"</span>: {}
        }
    ]
}
</pre>
</div>

<p>
log 的选项：
</p>
<ul class="org-ul">
<li>loglevel：日志级别，分别有 5 个，本例中设定的是 warning
<ul class="org-ul">
<li>debug：最详细的日志信息，专用于软件调试</li>
<li>info：比较详细的日志信息，可以看到 V2Ray 详细的连接信息</li>
<li>warning：警告信息。轻微的问题信息，经我观察 warning 级别的信息大多是网络错误。推荐使用 warning</li>
<li>error：错误信息。比较严重的错误信息。当出现 error 时该问题足以影响 V2Ray 的正常运行</li>
<li>none：空。不记录任何信息</li>
</ul></li>
<li>access：访问记录输出路径
<ul class="org-ul">
<li>"": 输出至控制台即 stdout</li>
<li>"none": 不输出</li>
<li>"/path/access.log": 输出至/path/access.log</li>
</ul></li>
<li>error：错误记录输出路径
<ul class="org-ul">
<li>"": 输出至控制台即 stdout</li>
<li>"none": 不输出</li>
<li>"/path/error.log": 输出至/path/error.log</li>
</ul></li>
</ul>

<pre class="example" id="orgd5b19d9">
在 json 中，反斜杠 \ 是转义字符，因此 Windows 操作系统目录的 \ 符号在配置中要使用 \\ 来表示
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="routing.html">Next: 路由</a></td>
<td class="org-left"><a href="log.html">Previous: 日志</a></td>
<td class="org-left"><a href="basic.html">Home: 基础</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
